# Используем официальный базовый образ Python для arm64
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем только файл зависимостей в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости Python
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Указываем порт, который будет слушать приложение
EXPOSE 80

# Запускаем приложение при старте контейнера
CMD ["python", "app.py"]
